import {IDetails} from "../components/Details/index.interfaces";

export const detailsMock: IDetails[] = [
    {
        id: 1,
        title: 'Минари',
        year: '2020',
        rating: '7.6',
        synopsis: 'Протагонист пытается обезвредить террориста с помощью уникальной технологии. Блокбастер-пазл Кристофера Нолана. ',
        genres: ['Фантастика', 'Боевик', 'Триллер']
    },
    {
        id: 2,
        title: 'Солнцестояние',
        year: '2020',
        rating: '7.6',
        synopsis: 'Протагонист пытается обезвредить террориста с помощью уникальной технологии. Блокбастер-пазл Кристофера Нолана. ',
        genres: ['Фантастика', 'Боевик', 'Триллер']
    },
    {
        id: 3,
        title: 'Манк',
        year: '2020',
        rating: '7.6',
        synopsis: 'Протагонист пытается обезвредить террориста с помощью уникальной технологии. Блокбастер-пазл Кристофера Нолана. ',
        genres: ['Фантастика', 'Боевик', 'Триллер']
    },
    {
        id: 4,
        title: 'Девушка, подающая надежды',
        year: '2020',
        rating: '7.6',
        synopsis: 'Протагонист пытается обезвредить террориста с помощью уникальной технологии. Блокбастер-пазл Кристофера Нолана. ',
        genres: ['Фантастика', 'Боевик', 'Триллер']
    },
    {
        id: 5,
        title: 'Земля кочевников',
        year: '2020',
        rating: '7.6',
        synopsis: 'Протагонист пытается обезвредить террориста с помощью уникальной технологии. Блокбастер-пазл Кристофера Нолана. ',
        genres: ['Фантастика', 'Боевик', 'Триллер']
    },
    {
        id: 6,
        title: 'Отец',
        year: '2020',
        rating: '7.6',
        synopsis: 'Протагонист пытается обезвредить террориста с помощью уникальной технологии. Блокбастер-пазл Кристофера Нолана. ',
        genres: ['Фантастика', 'Боевик', 'Триллер']
    },
    {
        id: 7,
        title: 'Ещё по одной',
        year: '2020',
        rating: '7.6',
        synopsis: 'Протагонист пытается обезвредить террориста с помощью уникальной технологии. Блокбастер-пазл Кристофера Нолана. ',
        genres: ['Фантастика', 'Боевик', 'Триллер']
    },
    {
        id: 8,
        title: 'Душа',
        year: '2020',
        rating: '7.6',
        synopsis: 'Протагонист пытается обезвредить террориста с помощью уникальной технологии. Блокбастер-пазл Кристофера Нолана. ',
        genres: ['Фантастика', 'Боевик', 'Триллер']
    },
    {
        id: 9,
        title: 'Годзилла',
        year: '2020',
        rating: '7.6',
        synopsis: 'Протагонист пытается обезвредить террориста с помощью уникальной технологии. Блокбастер-пазл Кристофера Нолана. ',
        genres: ['Фантастика', 'Боевик', 'Триллер']
    },
    {
        id: 10,
        title: 'Довод',
        year: '2020',
        rating: '7.6',
        synopsis: 'Протагонист пытается обезвредить террориста с помощью уникальной технологии. Блокбастер-пазл Кристофера Нолана. ',
        genres: ['Фантастика', 'Боевик', 'Триллер']
    },
]